#+title: AI Agents Guidance for bisos-pip PyCS Packages

This file provides guidance to Claude Code (claude.ai/code) when working with code in this repository.

* The csuListProc Dblock Pattern (csxu-s only)

In a *csxu* (CS eXecution Unit — the top-level =.cs= script), the
=####+BEGIN: b:py3:cs:framework/csuListProc= dblock is *not* self-contained.
It reads the elisp variable =b:py:cs:csuList= set by the =#+BEGIN_SRC emacs-lisp=
block that must appear immediately above it:

#+begin_example
""" #+begin_org
...  ~csuList emacs-list Specifications~  ...
#+BEGIN_SRC emacs-lisp
(setq  b:py:cs:csuList
  (list
   "bisos.startAiActivity.userConfig_csu"
 ))
#+END_SRC
#+RESULTS:
| bisos.startAiActivity.userConfig_csu |
#+end_org """

####+BEGIN: b:py3:cs:framework/csuListProc :pyImports t :csuImports t :csuParams t :csxuParams nil
...generated Python: from ... import ..., csuList = [...], g_extraParams...
####+END:
#+end_example

When the dblock is updated in Blee/Emacs, it evaluates that elisp, reads the
list, and regenerates the Python wiring inside the dblock (the =from ... import=
statements, =csuList = [...]= and the =g_extraParams= function body).

*Do not hand-author the csuListProc dblock body.* Author only the elisp
=b:py:cs:csuList= list above it; the dblock engine writes the Python.

Also note: =g_extraParams= (generated inside the dblock) calls only
=cs.csuList_commonParamsSpecify(csuList, csParams)= — it does *not* call the
csxu's own =commonParamsSpecify=. That is wired separately by the framework.

This pattern applies to *csxu-s only*. CSU files (=_csu.py=) do not have a
=csuListProc= dblock.

